###############################################################
#  Generated by:      Cadence Innovus 21.18-s099_1
#  OS:                Linux x86_64(Host ID arc-schaumont-class-vm)
#  Generated on:      Wed Dec  6 23:35:12 2023
#  Design:            fir_transpose
#  Command:           write_sdc out/design.sdc
###############################################################
current_design fir_transpose
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {Clk}]  -name Clk -period 2.000000 -waveform {0.000000 1.000000}
set_propagated_clock  [get_clocks {Clk}]
set_propagated_clock  [get_ports {Clk}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_value[8]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_address[7]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_address[1]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Din[4]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_value[11]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_value[4]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_address[3]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Reset}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Din[9]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_address[6]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Din[0]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_value[9]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_value[0]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_address[2]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Din[5]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {load}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_value[5]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_address[4]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_address[7]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Din[1]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_address[0]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_value[1]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_address[3]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Din[6]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_value[6]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_address[5]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Din[2]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_address[1]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_value[2]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Din[10]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Din[7]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_address[4]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_value[7]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_address[6]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_address[0]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Din[3]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_value[10]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_value[3]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {write_address[2]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_address[5]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Din[11]}]
set_input_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Din[8]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Dout[4]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_value[4]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Dout[2]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_value[2]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Dout[0]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_value[0]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Dout[10]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_value[10]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Dout[9]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_value[9]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Dout[7]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_value[7]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Dout[5]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_value[5]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Dout[3]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_value[3]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Dout[1]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_value[1]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Dout[11]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_value[11]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Dout[8]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_value[8]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {Dout[6]}]
set_output_delay -add_delay 0 -clock [get_clocks {Clk}] [get_ports {read_value[6]}]
